src/DataProcessors/МониторЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МониторЭД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДтВрмН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДтВрмК</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЭкспрессДоставкаОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЭкспрессДоставкаОбмен</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета_исх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета_вх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Error</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>express_delivery_request_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>operation_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаСТопЛогПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаСТопЛогПоОбъектам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоллары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕвро</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиВДокументе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналSMSоповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналSMSоповещения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидSMSоповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаSMSоповещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель_КА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТекстSMSоповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата_Формирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата_Отправки</Name>
					<Comment>в периоде указана плановая дата оповещения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыSMSоповещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыОплатыЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОплатыЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рубли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЦенеТовара</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИсточникиРеализаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИсточникиРеализаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/МониторЭД/Ext/ObjectModule.bsl
Функция ЗапроситьБД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭкспрессДоставкаОбмен.Период,
	|	ЭкспрессДоставкаОбмен.express_delivery_request_id,
	|	ЭкспрессДоставкаОбмен.operation_type,
	|	ЭкспрессДоставкаОбмен.ДатаОтправкиСообщения,
	|	ЭкспрессДоставкаОбмен.НомерПакета_исх,
	|	ЭкспрессДоставкаОбмен.НомерПакета_вх,
	|	ЭкспрессДоставкаОбмен.Error,
	|	ВЫРАЗИТЬ(ЭкспрессДоставкаОбмен.Description КАК СТРОКА(500)) КАК Description,
	|	ЭкспрессДоставкаОбмен.ДанныеПакета,
	|	ЭкспрессДоставкаОбмен.ОбработаноСайтом
	|ПОМЕСТИТЬ ИсторияОбменаССайтом
	|ИЗ
	|	РегистрСведений.ЭкспрессДоставкаОбмен КАК ЭкспрессДоставкаОбмен
	|ГДЕ
	|	ЭкспрессДоставкаОбмен.Период МЕЖДУ &Дата И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ИсторияОбменаССайтом.express_delivery_request_id,
	|	МАКСИМУМ(ИсторияОбменаССайтом.Error) КАК Error,
	|	МАКСИМУМ(ИсторияОбменаССайтом.Description) КАК Description
	|ПОМЕСТИТЬ Ошибки
	|ИЗ 
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ЭД_web
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_Init
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.Init""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_Add
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.Add""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_LogistConfirm
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.LogistConfirm""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_1cConfirm
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.1cConfirm""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_Cancel
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.Cancel""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_1cCancel
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.1cCancel""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_1cChange
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.1cChange""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияОбменаССайтом.Период) КАК Период,
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|ПОМЕСТИТЬ ОбменСайт_DeletePart
	|ИЗ
	|	ИсторияОбменаССайтом КАК ИсторияОбменаССайтом
	|ГДЕ
	|	ИсторияОбменаССайтом.operation_type = ""ExpressDelivery.DeletePart""
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменаССайтом.express_delivery_request_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭД_web.express_delivery_request_id КАК ed_id,
	|	ЕСТЬNULL(Ошибки.Error, ЛОЖЬ) КАК Error,
	|	ЕСТЬNULL(Ошибки.Description,"""") КАК Description,
	|	ЕСТЬNULL(ОбменСайт_Init.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_Init,
	|	ЕСТЬNULL(ОбменСайт_Add.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_Add,
	|	ЕСТЬNULL(ОбменСайт_DeletePart.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_DeletePart,
	|	ЕСТЬNULL(ОбменСайт_1cChange.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_1cChange,
	|	ЕСТЬNULL(ОбменСайт_LogistConfirm.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_Confirm,
	|	ЕСТЬNULL(ОбменСайт_1cConfirm.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_1cConfirm,
	|	ЕСТЬNULL(ОбменСайт_Cancel.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_Cancel,
	|	ЕСТЬNULL(ОбменСайт_1cCancel.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ed_1cCancel
	|ПОМЕСТИТЬ ЭД_web_Сводка
	|ИЗ
	|	ЭД_web КАК ЭД_web
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_Init КАК ОбменСайт_Init
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_Init.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_Add КАК ОбменСайт_Add
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_Add.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_LogistConfirm КАК ОбменСайт_LogistConfirm
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_LogistConfirm.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_1cConfirm КАК ОбменСайт_1cConfirm
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_1cConfirm.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_Cancel КАК ОбменСайт_Cancel
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_Cancel.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_1cCancel КАК ОбменСайт_1cCancel
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_1cCancel.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_1cChange КАК ОбменСайт_1cChange
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_1cChange.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменСайт_DeletePart КАК ОбменСайт_DeletePart
	|		ПО ЭД_web.express_delivery_request_id = ОбменСайт_DeletePart.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ Ошибки КАК Ошибки
	|		ПО ЭД_web.express_delivery_request_id = Ошибки.express_delivery_request_id
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.express_delivery_request_id,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Склад,
	|	РеализацияТоваровУслуг.МаршрутДоставки,
	|	РеализацияТоваровУслуг.Филиал,
	|	РеализацияТоваровУслуг.ТорговаяТочка,
	|	РеализацияТоваровУслуг.ВремяДоставкиС,
	|	РеализацияТоваровУслуг.ВремяДоставкиПо,
	|	РеализацияТоваровУслуг.ЭД_init,
	|	РеализацияТоваровУслуг.ЭД_СуммаБесплатнойЭД,
	|	РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДрубли,
	|	РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДбонусы,
	|	РеализацияТоваровУслуг.ЭД_ВидОплаты,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	РеализацияТоваровУслуг.ПолныйОтказ,
	|	РеализацияТоваровУслуг.ПометкаУдаления,
	|	РеализацияТоваровУслуг.Проведен,
	|	РеализацияТоваровУслуг.флНеВыгружатьВТопЛог
	|ПОМЕСТИТЬ РТУ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &Дата И &Дата2
	|	И РеализацияТоваровУслуг.ТипДоставки = &ТипДоставки
	|	И РеализацияТоваровУслуг.Источник = &Источник
	|	И РеализацияТоваровУслуг.express_delivery_request_id В
	|			(ВЫБРАТЬ
	|				ЭД_web_Сводка.ed_id
	|			ИЗ
	|				ЭД_web_Сводка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияОбменаСТопЛогПоОбъектам.Период,
	|	ИсторияОбменаСТопЛогПоОбъектам.Объект,
	|	ИсторияОбменаСТопЛогПоОбъектам.НомерСообщения,
	|	ИсторияОбменаСТопЛогПоОбъектам.Исходящее,
	|	ИсторияОбменаСТопЛогПоОбъектам.ЕстьОшибки,
	|	ИсторияОбменаСТопЛогПоОбъектам.НомерПотока,
	|	ИсторияОбменаСТопЛогПоОбъектам.ОписаниеОшибки
	|ПОМЕСТИТЬ ОбменТопЛог
	|ИЗ
	|	РегистрСведений.ИсторияОбменаСТопЛогПоОбъектам КАК ИсторияОбменаСТопЛогПоОбъектам
	|ГДЕ
	|	ИсторияОбменаСТопЛогПоОбъектам.Объект В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ОбменТопЛог.Период) КАК Период,
	|	ОбменТопЛог.Объект
	|ПОМЕСТИТЬ ОбменТопЛог_Выгрузка
	|ИЗ
	|	ОбменТопЛог КАК ОбменТопЛог
	|ГДЕ
	|	ОбменТопЛог.Исходящее = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменТопЛог.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ОбменТопЛог.Период) КАК Период,
	|	ОбменТопЛог.Объект
	|ПОМЕСТИТЬ ОбменТопЛог_Загрузка
	|ИЗ
	|	ОбменТопЛог КАК ОбменТопЛог
	|ГДЕ
	|	ОбменТопЛог.Исходящее = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменТопЛог.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ РТУ_Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В(&ЭД_Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	|	СУММА(РеализацияТоваровУслугТовары.ЭД_Сумма_Услуга) КАК ЭД_Сумма_Услуга
	|ПОМЕСТИТЬ РТУ_Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МегаЛогист_МаршрутноеЗаданиеДокументыРеализации.Ссылка,
	|	МегаЛогист_МаршрутноеЗаданиеДокументыРеализации.Ссылка.Дата КАК МЗ_Дата,
	|	МегаЛогист_МаршрутноеЗаданиеДокументыРеализации.ДокументСсылка
	|ПОМЕСТИТЬ МаршрутныеЗадания
	|ИЗ
	|	Документ.МегаЛогист_МаршрутноеЗадание.ДокументыРеализации КАК МегаЛогист_МаршрутноеЗаданиеДокументыРеализации
	|ГДЕ
	|	МегаЛогист_МаршрутноеЗаданиеДокументыРеализации.ДокументСсылка В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МегаЛогист_МаршрутныйЛистМаршрутныеЗадания.Ссылка,
	|	МегаЛогист_МаршрутныйЛистМаршрутныеЗадания.Ссылка.Дата КАК МЛ_Дата,
	|	МегаЛогист_МаршрутныйЛистМаршрутныеЗадания.ДокументСсылка
	|ПОМЕСТИТЬ МаршрутныеЛисты
	|ИЗ
	|	Документ.МегаЛогист_МаршрутныйЛист.МаршрутныеЗадания КАК МегаЛогист_МаршрутныйЛистМаршрутныеЗадания
	|ГДЕ
	|	МегаЛогист_МаршрутныйЛистМаршрутныеЗадания.ДокументСсылка В
	|			(ВЫБРАТЬ
	|				МаршрутныеЗадания.Ссылка
	|			ИЗ
	|				МаршрутныеЗадания)
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровОбороты.Регистратор,
	|	СУММА(ПартииТоваровОбороты.СуммаРублиРасход - ПартииТоваровОбороты.СуммаРублиПриход) КАК Сумма
	|ПОМЕСТИТЬ РТУ_себестоимость	
	|ИЗ
	|	РегистрНакопления.ПартииТоваров.Обороты(&Дата, &Дата2, Регистратор, ) КАК ПартииТоваровОбороты
	|ГДЕ
	|	ПартииТоваровОбороты.Регистратор В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровОбороты.Регистратор
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	
	|	РТУ.ПометкаУдаления КАК d_ПометкаУдаления,
	|	РТУ.ПолныйОтказ КАК d_ПолныйОтказ,
	|	РТУ.Проведен КАК d_Проведен,
	
	|	ЭД_web_Сводка.ed_id,
	
	|	ЭД_web_Сводка.Error,
	|	ЭД_web_Сводка.Description,
	
	|	ЭД_web_Сводка.ed_Init,
	|	ЭД_web_Сводка.ed_Add,
	|	ЕСТЬNULL(МаршрутныеЗадания.МЗ_Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК z_МЗадание,
	|	ЭД_web_Сводка.ed_DeletePart,
	|	ЭД_web_Сводка.ed_1cChange,
	|	ЭД_web_Сводка.ed_Cancel,
	|	ЭД_web_Сводка.ed_1cCancel,
	|	ЭД_web_Сводка.ed_Confirm,
	|	ЭД_web_Сводка.ed_1cConfirm,
	|	ЕСТЬNULL(МаршрутныеЛисты.МЛ_Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК l_МЛист,
	|	РТУ.ВремяДоставкиС КАК d_ВремяДоставкиС,
	|	РТУ.ВремяДоставкиПо КАК d_ВремяДоставкиПо,
	
	|	РТУ.флНеВыгружатьВТопЛог КАК d_флНеВыгружатьВТопЛог,
	
	|	ЕСТЬNULL(ОбменТопЛог_Выгрузка.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК d_Выгрузка,
	|	ЕСТЬNULL(ОбменТопЛог_Загрузка.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК d_Загрузка,
	
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОбменТопЛог_Выгрузка.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ОбменТопЛог_Загрузка.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЕСТЬNULL(ОбменТопЛог_Выгрузка.Период, ДАТАВРЕМЯ(1, 1, 1)), ЕСТЬNULL(ОбменТопЛог_Загрузка.Период, ДАТАВРЕМЯ(1, 1, 1)), МИНУТА)
	|	КОНЕЦ КАК d_МинутыОбработкаВТопЛог,
	|	
	|	РТУ.Дата КАК d_Дата,
	|	РТУ.Номер КАК d_Номер,
	
	|	РТУ.Ссылка КАК РТУ,
	
	|	РТУ.Ссылка.Статус КАК Статус,
	|	РТУ.Ссылка.СтатусДокумента КАК СтатусДокумента,
	
	|	
	|	РТУ.Организация КАК d_Организация,
	|	РТУ.Контрагент КАК d_Контрагент,
	|	РТУ.Склад КАК d_Склад,
	|	РТУ.МаршрутДоставки КАК d_МаршрутДоставки,
	|	РТУ.Филиал КАК d_Филиал,
	|	РТУ.Контрагент.ОсновнаяТорговаяТочка.Регион КАК Регион,
	|	РТУ.ТорговаяТочка КАК d_ТорговаяТочка,
	|	РТУ.ЭД_init КАК d_ЭД_init,
	|	РТУ.ЭД_СуммаБесплатнойЭД КАК d_ЭД_СуммаБесплатнойЭД,
	|	РТУ.ЭД_СтоимостьУслугиЭДрубли КАК d_ЭД_СтоимостьУслугиЭДрубли,
	|	РТУ.ЭД_СтоимостьУслугиЭДбонусы КАК d_ЭД_СтоимостьУслугиЭДбонусы,
	|	РТУ.ЭД_ВидОплаты КАК d_ЭД_ВидОплаты,
	|	
	|	РТУ.СуммаДокумента КАК d_СуммаДокумента,
	|	ЕСТЬNULL(РТУ_Товары.Сумма,0)- ЕСТЬNULL(РТУ_Товары.ЭД_Сумма_Услуга,0) d_СуммаТовары,
	|	ЕСТЬNULL(РТУ_Услуги.Сумма,0) d_СуммаУслугаРубли,
	|	ЕСТЬNULL(РТУ_Товары.ЭД_Сумма_Услуга,0) d_СуммаУслугаВЦенеТовара,
	
	|	естьNULL(РТУ_себестоимость.Сумма,0) КАК СуммаСебестоимость,
	|	ЕСТЬNULL(РТУ_Товары.Сумма,0) - ЕСТЬNULL(РТУ_Товары.ЭД_Сумма_Услуга,0) - естьNULL(РТУ_себестоимость.Сумма,0) КАК Прибыль,
	|	
	|	МаршрутныеЗадания.Ссылка КАК МаршрутноеЗадание,
	|	МаршрутныеЛисты.Ссылка КАК МаршрутныйЛист,
	
	
	|	1 КАК Сч
	
	|ПОМЕСТИТЬ ПолныйРасклад
	
	|ИЗ
	|	ЭД_web_Сводка КАК ЭД_web_Сводка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РТУ КАК РТУ
	|		ПО ЭД_web_Сводка.ed_id = РТУ.express_delivery_request_id
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменТопЛог_Выгрузка КАК ОбменТопЛог_Выгрузка
	|		ПО (РТУ.Ссылка = ОбменТопЛог_Выгрузка.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбменТопЛог_Загрузка КАК ОбменТопЛог_Загрузка
	|		ПО (РТУ.Ссылка = ОбменТопЛог_Загрузка.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РТУ_Услуги КАК РТУ_Услуги
	|		ПО (РТУ.Ссылка = РТУ_Услуги.Ссылка)		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РТУ_Товары КАК РТУ_Товары
	|		ПО (РТУ.Ссылка = РТУ_Товары.Ссылка)				
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутныеЗадания КАК МаршрутныеЗадания
	|		ПО (РТУ.Ссылка = МаршрутныеЗадания.ДокументСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутныеЛисты КАК МаршрутныеЛисты
	|		ПО (МаршрутныеЗадания.Ссылка = МаршрутныеЛисты.ДокументСсылка)
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РТУ_себестоимость КАК РТУ_себестоимость
	|		ПО (РТУ.Ссылка = РТУ_себестоимость.Регистратор)				
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолныйРасклад.d_Филиал КАК Филиал,
	|	ПолныйРасклад.ed_id КАК id,
	|	МАКСИМУМ(ПолныйРасклад.Error) КАК Error,
	|	МАКСИМУМ(ПолныйРасклад.Description) КАК Description,
	|	МИНИМУМ(ПолныйРасклад.ed_Init) КАК Init,
	|	МАКСИМУМ(ПолныйРасклад.ed_Add) КАК Add,
	|	МАКСИМУМ(ПолныйРасклад.z_МЗадание) КАК МЗадание,
	|	МАКСИМУМ(ПолныйРасклад.ed_DeletePart) КАК Delete,
	|	МАКСИМУМ(ПолныйРасклад.ed_1cChange) КАК Change1с,
	|	МАКСИМУМ(ПолныйРасклад.ed_Cancel) КАК Cancel,
	|	МАКСИМУМ(ПолныйРасклад.ed_1cCancel) КАК Cancel1с,
	|	МАКСИМУМ(ПолныйРасклад.ed_Confirm) КАК Confirm,
	|	МАКСИМУМ(ПолныйРасклад.ed_1cConfirm) КАК Confirm1с,
	|	МАКСИМУМ(ПолныйРасклад.l_МЛист) КАК МЛист,
	|	МИНИМУМ(ПолныйРасклад.d_ВремяДоставкиС) КАК ДоставкаС,
	|	МАКСИМУМ(ПолныйРасклад.d_ВремяДоставкиПо) КАК ДоставкаПо,
	|	МИНИМУМ(ПолныйРасклад.d_Выгрузка) КАК Выгрузка,
	|	МАКСИМУМ(ПолныйРасклад.d_Загрузка) КАК Загрузка,
	
	|	СУММА(ПолныйРасклад.Сч) КАК РТУ,
	|	МАКСИМУМ(ПолныйРасклад.d_ЭД_ВидОплаты) КАК ВидОплаты,
	|	МАКСИМУМ(ПолныйРасклад.d_ЭД_СуммаБесплатнойЭД) КАК СуммаБесплатнойЭД,
	|	СУММА(ПолныйРасклад.d_СуммаДокумента) КАК СуммаДокумента,
	|	СУММА(ПолныйРасклад.d_СуммаТовары) КАК СуммаТовары,
	|	СУММА(ПолныйРасклад.d_СуммаУслугаРубли) КАК СуммаУслугаРубли,
	|	СУММА(ПолныйРасклад.d_СуммаУслугаВЦенеТовара) КАК СуммаУслугаВЦенеТовара,
	
	|   ВЫБОР
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОплатыЭД.Бонусы) = МАКСИМУМ(ПолныйРасклад.d_ЭД_ВидОплаты) И МАКСИМУМ(ПолныйРасклад.d_ЭД_СуммаБесплатнойЭД) > СУММА(ПолныйРасклад.d_СуммаТовары) ТОГДА  МАКСИМУМ(ПолныйРасклад.d_ЭД_СтоимостьУслугиЭДбонусы)
	|       ИНАЧЕ 0
	|   Конец КАК СуммаБонусы,
	
	|	СУММА(ПолныйРасклад.СуммаСебестоимость) КАК СуммаСебестоимость,
	|	СУММА(ПолныйРасклад.Прибыль) КАК Прибыль,
	
	|	СРЕДНЕЕ(ПолныйРасклад.d_МинутыОбработкаВТопЛог) КАК МинутыОбработкаВТопЛог
	|ИЗ
	|	ПолныйРасклад КАК ПолныйРасклад
	|
	|СГРУППИРОВАТЬ ПО
	|	ПолныйРасклад.d_Филиал,
	|	ПолныйРасклад.ed_id
	
	|УПОРЯДОЧИТЬ ПО
	|	СУММА(ПолныйРасклад.d_СуммаДокумента) УБЫВ,
	|	ПолныйРасклад.d_Филиал,
	|	ПолныйРасклад.ed_id
	
	|ИТОГИ
	|	МИНИМУМ(Init),
	|	МИНИМУМ(ДоставкаС),
	|	МАКСИМУМ(ДоставкаПо),
	
	|	МАКСИМУМ(Confirm),
	|	МАКСИМУМ(Confirm1с),
	
	|	СРЕДНЕЕ(МинутыОбработкаВТопЛог),
	
	|	СУММА(СуммаДокумента),
	|	СУММА(СуммаТовары),
	|	СУММА(СуммаУслугаРубли),
	|	СУММА(СуммаУслугаВЦенеТовара),
	|	СУММА(СуммаБонусы),
	|	СУММА(СуммаСебестоимость),
	|	СУММА(Прибыль),
	
	|	СУММА(РТУ)
	
	|ПО
	|	ПолныйРасклад.d_Филиал
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналSMSоповещенияСрезПоследних.id,
	|	ЖурналSMSоповещенияСрезПоследних.Дата_Формирования,
	|	ЖурналSMSоповещенияСрезПоследних.Период,
	|	ЖурналSMSоповещенияСрезПоследних.Отправлено,
	|	ЖурналSMSоповещенияСрезПоследних.Дата_Отправки,
	|	ЖурналSMSоповещенияСрезПоследних.Статус,
	|	ЖурналSMSоповещенияСрезПоследних.Ошибка,
	|	ЖурналSMSоповещенияСрезПоследних.Источник,
	|	ЖурналSMSоповещенияСрезПоследних.ВидSMSоповещения,
	|	ЖурналSMSоповещенияСрезПоследних.Получатель_КА КАК КА,
	|	ЖурналSMSоповещенияСрезПоследних.Получатель_НомерТелефона КАК НомерТелефона,
	|	ЖурналSMSоповещенияСрезПоследних.ТекстSMSоповещения
	|ИЗ
	|	РегистрСведений.ЖурналSMSоповещения.СрезПоследних КАК ЖурналSMSоповещенияСрезПоследних
	|ГДЕ
	|	ЖурналSMSоповещенияСрезПоследних.Источник В
	|			(ВЫБРАТЬ
	|				РТУ.Ссылка
	|			ИЗ
	|				РТУ
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				МаршрутныеЗадания.Ссылка
	|			ИЗ
	|				МаршрутныеЗадания
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				МаршрутныеЛисты.Ссылка
	|			ИЗ
	|				МаршрутныеЛисты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ *
	|ИЗ
	|	ПолныйРасклад КАК ПолныйРасклад";
	
	у_м = новый Массив;
	ИмяПараметраУслугаДоставки = "Услуга экспресс-доставки (Безнал)";
	у_м.Добавить(РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", ИмяПараметраУслугаДоставки, Константы.УслугаЭкспрессДоставка.Получить()));
	ИмяПараметраУслугаДоставки = "Услуга экспресс-доставки (Нал)";
	у_м.Добавить(РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", ИмяПараметраУслугаДоставки, Константы.УслугаЭкспрессДоставка.Получить()));
	
	Запрос.УстановитьПараметр("Дата", ДтВрмН);
	Запрос.УстановитьПараметр("Дата2", ДтВрмК);
	Запрос.УстановитьПараметр("Источник", Перечисления.ИсточникиРеализаций.Сайт);
	Запрос.УстановитьПараметр("ТипДоставки", Справочники.ТипыДоставки.ЭкспрессДоставка);
	Запрос.УстановитьПараметр("ЭД_Услуга", у_м);
	
	//Сообщить(Запрос.Текст);
	
	Результат = Запрос.ВыполнитьПакет();	
	
	Результат_Количество = Результат.Количество();
	
	ЭД   = Результат[Результат_Количество - 3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	РТУ  = Результат[Результат_Количество - 1].Выгрузить();
	SMS  = Результат[Результат_Количество - 2].Выгрузить();
	
	Возврат Новый Структура("ЭД,РТУ,SMS",ЭД,РТУ,SMS);
	
КонецФункции
